{"maximumSentences":7,"searchTerm":"t-shirt","prefix":"The history of","sourceContentOriginal":"A shirt is a cloth garment for the upper body (from the neck to the waist).\nOriginally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments. In British English, a shirt is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps (North Americans would call that a \"dress shirt\", a specific type of collared shirt). A shirt can also be worn with a necktie under the shirt collar.\n\n\n== History ==\nThe world's oldest preserved garment, discovered by Flinders Petrie, is a \"highly sophisticated\" linen shirt from a First Dynasty Egyptian tomb at Tarkan, dated to c. 3000 BC: \"the shoulders and sleeves have been finely pleated to give form-fitting trimness while allowing the wearer room to move. The small fringe formed during weaving along one edge of the cloth has been placed by the designer to decorate the neck opening and side seam.\"The shirt was an item of clothing that only men could wear as underwear, until the twentieth century.  Although the women's chemise was a closely related garment to the men's, it is the men's garment that became the modern shirt. In the Middle Ages, it was a plain, undyed garment worn next to the skin and under regular garments. In medieval artworks, the shirt is only visible (uncovered) on humble characters, such as shepherds, prisoners, and penitents.  In the seventeenth century, men's shirts were allowed to show, with much the same erotic import as visible underwear today. In the eighteenth century, instead of underpants, men \"relied on the long tails of shirts ... to serve the function of drawers.  Eighteenth-century costume historian Joseph Strutt believed that men who did not wear shirts to bed were indecent.  Even as late as 1879, a visible shirt with nothing over it was considered improper.The shirt sometimes had frills at the neck or cuffs.  In the sixteenth century, men's shirts often had embroidery, and sometimes frills or lace at the neck and cuffs and through the eighteenth-century long neck frills, or jabots, were fashionable. Coloured shirts began to appear in the early nineteenth century, as can be seen in the paintings of George Caleb Bingham.  They were considered casual wear, for lower-class workers only, until the twentieth century.  For a gentleman, \"to wear a sky-blue shirt was unthinkable in 1860 but had become standard by 1920 and, in 1980, constituted the most commonplace event.\"European and American women began wearing shirts in 1860, when the Garibaldi shirt, a red shirt as worn by the freedom fighters under Giuseppe Garibaldi, was popularized by Empress Eugénie of France. At the end of the nineteenth century, the Century Dictionary described an ordinary shirt as \"of cotton, with linen bosom, wristbands and cuffs prepared for stiffening with starch, the collar and wristbands being usually separate and adjustable\".\nThe first documented appearance of the expression \"To give the shirt off one's back\", happened in 1771 as an idiom that indicates extreme desperation or generosity and is still in common usage. In 1827 Hannah Montague, a housewife in upstate New York, invents the detachable collar. Tired of constantly washing her husband's entire shirt when only the collar needed it, she cut off his collars and devised a way of attaching them to the neckband after washing. It wasn't until the 1930s that collar stays became popular, although these early accessories resembled tie clips more than the small collar stiffeners available today. They connected the collar points to the necktie, keeping them in place \n\n\n== Types ==\n\nCamp shirt – a loose, straight-cut, short sleeved shirt or blouse with a simple placket front-opening and a \"camp collar\".\nDress shirt – shirt with a formal (somewhat stiff) collar, a full-length opening at the front from the collar to the hem (usually buttoned), and sleeves with cuffs\nWhite shirt - usually dress shirt which its colour is white\nDinner shirt – a shirt specifically made to be worn with male evening wear, e.g. a black tie or white tie.\nGuayabera – an embroidered dress shirt with four pockets.\nPoet shirt – a loose-fitting shirt or blouse with full bishop sleeves, usually with large frills on the front and on the cuffs.\nT-shirt – also \"tee shirt\", a casual shirt without a collar or buttons, made of a stretchy, finely knit fabric, usually cotton, and usually short-sleeved. Originally worn under other shirts, it is now a common shirt for everyday wear in some countries.\nLong-sleeved T-shirt – a T-shirt with long sleeves that extend to cover the arms.\nRinger T-shirt – tee with a separate piece of fabric sewn on as the collar and sleeve hems\nHalfshirt – a high-hemmed T-shirt\nSleeveless shirt – a shirt manufactured without sleeves, or one whose sleeves have been cut off, also called a tank top\nA-shirt or vest or singlet (in British English) – essentially a sleeveless shirt with large armholes and a large neck hole, often worn by labourers or athletes for increased movability.\nCamisole – woman's undershirt with narrow straps, or a similar garment worn alone (often with bra). Also referred to as a cami, shelf top, spaghetti straps or strappy top\nPolo shirt (also tennis shirt or golf shirt) – a pullover soft collar short-sleeved shirt with an abbreviated button placket at the neck and a longer back than front (the \"tennis tail\").\nRugby shirt –  a long-sleeved polo shirt, traditionally of rugged construction in thick cotton or wool, but often softer today\nHenley shirt –  a collarless polo shirt\nBaseball shirt (jersey) – usually distinguished by a three-quarters sleeve, team insignia, and flat waist seam\nSweatshirt – long-sleeved athletic shirt of heavier material, with or without hood\nTunic – primitive shirt, distinguished by two-piece construction. Initially a men's garment, is normally seen in modern times being worn by women\nShirtwaist – historically (circa. 1890–1920) a woman's tailored shirt (also called a \"tailored waist\") cut like a man's dress shirt; in contemporary usage, a woman's dress cut like a men's dress shirt to the waist, then extended into dress length at the bottom\nNightshirt – often oversized, ruined or inexpensive light cloth undergarment shirt for sleeping.\nHalter top – a shoulderless, sleeveless garment for women. It is mechanically analogous to an apron with a string around the back of the neck and across the lower back holding it in place.\nTop shirt – a long-sleeved collarless polo shirt\nHeavy shirt – a shirt with the heavy size that covers up under the neck\nOnesie or diaper shirt – a shirt for infants which includes a long back that is wrapped between the legs and buttoned to the front of the shirt\nTube top (in American English) or boob tube (in British English) – a shoulderless, sleeveless \"tube\" that wraps the torso not reaching higher than the armpit, staying in place by elasticity or by a single strap that is attached to the front of the tube\nPunishment shirts were special shirts made for the condemned, either those cursed supernaturally, such as the poisoned shirt that killed Creusa (daughter of Creon), the Shirt of Nessus used to kill Hercules, those used to execute people in ancient Rome, such as the Tunica molesta, and those used in church heresy trials, such as the Shirt of Flame, or the Sanbenito\n\n\n== Parts of shirt ==\nMany terms are used to describe and differentiate types of shirts (and upper-body garments in general) and their construction. The smallest differences may have significance to a cultural or occupational group. Recently, (late twentieth century, into the twenty-first century) it has become common to use tops as a form of advertisement. Many of these distinctions apply to other upper-body garments, such as coats and sweaters.\n\n\n=== Shoulders and arms ===\n\n\n==== Sleeves ====\n\nShirts may:\n\nhave no covering of the shoulders or arms – a tube top (not reaching higher than the armpits, staying in place by elasticity)\nhave only shoulder straps, such as spaghetti straps\ncover the shoulders, but without sleeves\nhave shoulderless sleeves, short or long, with or without shoulder straps, that expose the shoulders, but cover the rest of the arm from the biceps and triceps down to at least the elbow\nhave short sleeves, varying from cap sleeves (covering only the shoulder and not extending below the armpit) to half sleeves (elbow length), with some having quarter-length sleeves (reaching to a point that covers half of the biceps and triceps area)\nhave three-quarter-length sleeves (reaching to a point between the elbow and the wrist)\nhave long sleeves (reaching a point to the wrist to a little beyond wrist)\n\n\n==== Cuffs ====\n\nShirts with long sleeves may further be distinguished by the cuffs:\n\nno buttons – a closed placket cuff\nbuttons (or analogous fasteners such as snaps) – single or multiple. A single button or pair aligned parallel with the cuff hem is considered a button cuff. Multiple buttons aligned perpendicular to the cuff hem, or parallel to the placket constitute a barrel cuff.\nbuttonholes designed for cufflinks\na French cuff, where the end half of the cuff is folded over the cuff itself and fastened with a cufflink. This type of cuff has four buttons and a short placket.\nmore formally, a link cuff – fastened like a French cuff, except is not folded over, but instead hemmed, at the edge of the sleeve.\nasymmetrical designs, such as one-shoulder, one-sleeve or with sleeves of different lengths.\n\n\n=== Lower hem ===\nhanging to the waist\nleaving the belly button area bare (much more common for women than for men). See halfshirt.\ncovering the crotch\ncovering part of the legs (essentially this is a dress; however, a piece of clothing is perceived either as a shirt (worn with trousers) or as a dress (in Western culture mainly worn by women)).\ngoing to the floor (as a pajama shirt)\n\n\n=== Body ===\nvertical opening on the front side, all the way down, with buttons or zipper. When fastened with buttons, this opening is often called the placket front.\nsimilar opening, but in back.\nleft and right front side not separable, put on over the head; with regard to upper front side opening:\nV-shaped permanent opening on the top of the front side\nno opening at the upper front side\nvertical opening on the upper front side with buttons or zipper\nmen's shirts are often buttoned on the right whereas women's are often buttoned on the left.\n\n\n=== Neck ===\nwith polo-neck\nwith \"scoop\" neck\nwith v-neck but no collar\nwith plunging neck\nwith open or tassel neck\nwith collar\nwindsor collar or spread collar – a dressier collar designed with a wide distance between points (the spread) to accommodate the windsor knot tie. The standard business collar.\ntab collar – a collar with two small fabric tabs that fasten together behind a tie to maintain collar spread.\nwing collar – best suited for the bow tie, often only worn for very formal occasions.\nstraight collar – or point collar, a version of the windsor collar that is distinguished by a narrower spread to better accommodate the four-in-hand knot, pratt knot, and the half-windsor knot. A moderate dress collar.\nbutton-down collar – A collar with buttons that fasten the points or tips to a shirt. The most casual of collars worn with a tie.\nband collar – essentially the lower part of a normal collar, first used as the original collar to which a separate collarpiece was attached. Rarely seen in modern fashion. Also casual.\nturtle neck collar – A collar that covers most of the throat.\nwithout collar\nV-neck no collar – The neckline protrudes down the chest and to a point, creating a \"V\"-looking neckline.\n\n\n=== Other features ===\npockets – how many (if any), where, and with regard to closure: not closable, just a flap, or with a button or zipper.\nwith or without hoodSome combinations are not applicable, e.g. a tube top cannot have a collar.\n\n\n== Measures and sizes ==\nThe main measures for a jacket are:\n\nShoulders\nBust\nWaist\nHip\nSleeve\nLength, from the neck to the waist or hip.\n\n\n=== Sizes ===\nAsia Size M = US/EU Size XS.\nAsia Size L = US/EU Size S.\nAsia Size XL = US/EU Size M.\nAsia Size XXL = US/EU Size L.\nAsia Size XXXL = US/EU Size XL.\nAsia Size XXXXL = US/EU Size XXL.\n\n\n== Types of fabric ==\nThere are two main categories of fibres used: natural fibre and man-made fibre (synthetics or petroleum based). Some natural fibres are linen, the first used historically, hemp, cotton, the most used, ramie, wool, silk and more recently bamboo or soya. Some synthetic fibres are polyester, tencel, viscose, etc. Polyester mixed with cotton (poly-cotton) is often used. Fabrics for shirts are called shirtings. The four main weaves for shirtings are plain weave, oxford, twill and satin. Broadcloth, poplin and end-on-end are variations of the plain weave. After weaving, finishing can be applied to the fabric.\n\n\n== Shirts and politics ==\n\nIn the 1920s and 1930s, fascists wore different coloured shirts:\n\nBlack shirts were used by the Italian fascists, and in Britain, Finland and Germany and Croatia. The party leaders of Dravidar Kazhagam in India wear only black shirts to symbolise atheism.\nBrownshirts were worn by German Nazis of the SA.\nThe Blueshirts was a fascist movement in Ireland and Canada, and the colour of the Portuguese Nacional Sindicalistas, the Spanish Falange Española, the French Solidarité Française, and the Chinese Blue Shirts Society.\nGreen shirts were used in Hungary, Ireland, Romania, Brazil and Portugal.\nCamisas Doradas (golden shirts) were used in Mexico.\nRed shirts were worn by the racist and antisemitic Bulgarian Ratniks.\nSilver Shirts were worn in the United States of America.\nGrey shirts were worn by members of the Fatherland League in Norway.In addition, red shirts have been used to symbolize a variety of different political groups, including Garibaldi's Italian revolutionaries, nineteenth-century American street gangs, and socialist militias in Spain and Mexico during the 1930s.\nDifferent colored shirts signified the major opposing sides that featured prominently in the 2008 Thai political crisis, with red having been worn by the supporters of the populist People's Power Party (PPP), and yellow being worn by the supporters of the royalist and anti-Thaksin Shinawatra movement the People's Alliance for Democracy (PAD). Each side is commonly referred to as the 'red shirts' and 'yellow shirts' respectively, though the later opponents of the later Thaksin supporting groups have largely ceased wearing yellow shirts to protest rallies.\nIn the UK, the Social Credit movement of the thirties wore green shirts.\n\n\n== Industrial production ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\nCardigan (sweater)\nDescamisado\nJermyn Street, home of the oldest English shirtmakers\n\n\n== References ==\n\n\n== External links ==\n\"Introduction to 18th-century fashion\". Fashion, Jewellery & Accessories. Victoria and Albert Museum.\n\"Introduction to 19th-century fashion\". Fashion, Jewellery & Accessories. Victoria and Albert Museum.","sourceContentSanitized":"A shirt is a cloth garment for the upper body . Originally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments. In British English, a shirt is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps . A shirt can also be worn with a necktie under the shirt collar. The world's oldest preserved garment, discovered by Flinders Petrie, is a \"highly sophisticated\" linen shirt from a First Dynasty Egyptian tomb at Tarkan, dated to c. 3000 BC: \"the shoulders and sleeves have been finely pleated to give form-fitting trimness while allowing the wearer room to move. The small fringe formed during weaving along one edge of the cloth has been placed by the designer to decorate the neck opening and side seam.\"The shirt was an item of clothing that only men could wear as underwear, until the twentieth century. Although the women's chemise was a closely related garment to the men's, it is the men's garment that became the modern shirt. In the Middle Ages, it was a plain, undyed garment worn next to the skin and under regular garments. In medieval artworks, the shirt is only visible on humble characters, such as shepherds, prisoners, and penitents. In the seventeenth century, men's shirts were allowed to show, with much the same erotic import as visible underwear today. In the eighteenth century, instead of underpants, men \"relied on the long tails of shirts ... to serve the function of drawers. Eighteenth-century costume historian Joseph Strutt believed that men who did not wear shirts to bed were indecent. Even as late as 1879, a visible shirt with nothing over it was considered improper.The shirt sometimes had frills at the neck or cuffs. In the sixteenth century, men's shirts often had embroidery, and sometimes frills or lace at the neck and cuffs and through the eighteenth-century long neck frills, or jabots, were fashionable. Coloured shirts began to appear in the early nineteenth century, as can be seen in the paintings of George Caleb Bingham. They were considered casual wear, for lower-class workers only, until the twentieth century. For a gentleman, \"to wear a sky-blue shirt was unthinkable in 1860 but had become standard by 1920 and, in 1980, constituted the most commonplace event.\"European and American women began wearing shirts in 1860, when the Garibaldi shirt, a red shirt as worn by the freedom fighters under Giuseppe Garibaldi, was popularized by Empress Eugénie of France. At the end of the nineteenth century, the Century Dictionary described an ordinary shirt as \"of cotton, with linen bosom, wristbands and cuffs prepared for stiffening with starch, the collar and wristbands being usually separate and adjustable\". The first documented appearance of the expression \"To give the shirt off one's back\", happened in 1771 as an idiom that indicates extreme desperation or generosity and is still in common usage. In 1827 Hannah Montague, a housewife in upstate New York, invents the detachable collar. Tired of constantly washing her husband's entire shirt when only the collar needed it, she cut off his collars and devised a way of attaching them to the neckband after washing. It wasn't until the 1930s that collar stays became popular, although these early accessories resembled tie clips more than the small collar stiffeners available today. They connected the collar points to the necktie, keeping them in place Camp shirt – a loose, straight-cut, short sleeved shirt or blouse with a simple placket front-opening and a \"camp collar\". Dress shirt – shirt with a formal collar, a full-length opening at the front from the collar to the hem , and sleeves with cuffs White shirt - usually dress shirt which its colour is white Dinner shirt – a shirt specifically made to be worn with male evening wear, e.g. a black tie or white tie. Guayabera – an embroidered dress shirt with four pockets. Poet shirt – a loose-fitting shirt or blouse with full bishop sleeves, usually with large frills on the front and on the cuffs. T-shirt – also \"tee shirt\", a casual shirt without a collar or buttons, made of a stretchy, finely knit fabric, usually cotton, and usually short-sleeved. Originally worn under other shirts, it is now a common shirt for everyday wear in some countries. Long-sleeved T-shirt – a T-shirt with long sleeves that extend to cover the arms. Ringer T-shirt – tee with a separate piece of fabric sewn on as the collar and sleeve hems Halfshirt – a high-hemmed T-shirt Sleeveless shirt – a shirt manufactured without sleeves, or one whose sleeves have been cut off, also called a tank top A-shirt or vest or singlet – essentially a sleeveless shirt with large armholes and a large neck hole, often worn by labourers or athletes for increased movability. Camisole – woman's undershirt with narrow straps, or a similar garment worn alone . Also referred to as a cami, shelf top, spaghetti straps or strappy top Polo shirt – a pullover soft collar short-sleeved shirt with an abbreviated button placket at the neck and a longer back than front . Rugby shirt – a long-sleeved polo shirt, traditionally of rugged construction in thick cotton or wool, but often softer today Henley shirt – a collarless polo shirt Baseball shirt – usually distinguished by a three-quarters sleeve, team insignia, and flat waist seam Sweatshirt – long-sleeved athletic shirt of heavier material, with or without hood Tunic – primitive shirt, distinguished by two-piece construction. Initially a men's garment, is normally seen in modern times being worn by women Shirtwaist – historically a woman's tailored shirt cut like a man's dress shirt; in contemporary usage, a woman's dress cut like a men's dress shirt to the waist, then extended into dress length at the bottom Nightshirt – often oversized, ruined or inexpensive light cloth undergarment shirt for sleeping. Halter top – a shoulderless, sleeveless garment for women. It is mechanically analogous to an apron with a string around the back of the neck and across the lower back holding it in place. Top shirt – a long-sleeved collarless polo shirt Heavy shirt – a shirt with the heavy size that covers up under the neck Onesie or diaper shirt – a shirt for infants which includes a long back that is wrapped between the legs and buttoned to the front of the shirt Tube top or boob tube – a shoulderless, sleeveless \"tube\" that wraps the torso not reaching higher than the armpit, staying in place by elasticity or by a single strap that is attached to the front of the tube Punishment shirts were special shirts made for the condemned, either those cursed supernaturally, such as the poisoned shirt that killed Creusa , the Shirt of Nessus used to kill Hercules, those used to execute people in ancient Rome, such as the Tunica molesta, and those used in church heresy trials, such as the Shirt of Flame, or the Sanbenito Many terms are used to describe and differentiate types of shirts and their construction. The smallest differences may have significance to a cultural or occupational group. Recently, it has become common to use tops as a form of advertisement. Many of these distinctions apply to other upper-body garments, such as coats and sweaters. Shirts may: have no covering of the shoulders or arms – a tube top have only shoulder straps, such as spaghetti straps cover the shoulders, but without sleeves have shoulderless sleeves, short or long, with or without shoulder straps, that expose the shoulders, but cover the rest of the arm from the biceps and triceps down to at least the elbow have short sleeves, varying from cap sleeves to half sleeves , with some having quarter-length sleeves have three-quarter-length sleeves have long sleeves Shirts with long sleeves may further be distinguished by the cuffs: no buttons – a closed placket cuff buttons – single or multiple. A single button or pair aligned parallel with the cuff hem is considered a button cuff. Multiple buttons aligned perpendicular to the cuff hem, or parallel to the placket constitute a barrel cuff. buttonholes designed for cufflinks a French cuff, where the end half of the cuff is folded over the cuff itself and fastened with a cufflink. This type of cuff has four buttons and a short placket. more formally, a link cuff – fastened like a French cuff, except is not folded over, but instead hemmed, at the edge of the sleeve. asymmetrical designs, such as one-shoulder, one-sleeve or with sleeves of different lengths. hanging to the waist leaving the belly button area bare . See halfshirt. covering the crotch covering part of the legs . going to the floor vertical opening on the front side, all the way down, with buttons or zipper. When fastened with buttons, this opening is often called the placket front. similar opening, but in back. left and right front side not separable, put on over the head; with regard to upper front side opening: V-shaped permanent opening on the top of the front side no opening at the upper front side vertical opening on the upper front side with buttons or zipper men's shirts are often buttoned on the right whereas women's are often buttoned on the left. with polo-neck with \"scoop\" neck with v-neck but no collar with plunging neck with open or tassel neck with collar windsor collar or spread collar – a dressier collar designed with a wide distance between points to accommodate the windsor knot tie. The standard business collar. tab collar – a collar with two small fabric tabs that fasten together behind a tie to maintain collar spread. wing collar – best suited for the bow tie, often only worn for very formal occasions. straight collar – or point collar, a version of the windsor collar that is distinguished by a narrower spread to better accommodate the four-in-hand knot, pratt knot, and the half-windsor knot. A moderate dress collar. button-down collar – A collar with buttons that fasten the points or tips to a shirt. The most casual of collars worn with a tie. band collar – essentially the lower part of a normal collar, first used as the original collar to which a separate collarpiece was attached. Rarely seen in modern fashion. Also casual. turtle neck collar – A collar that covers most of the throat. without collar V-neck no collar – The neckline protrudes down the chest and to a point, creating a \"V\"-looking neckline. pockets – how many , where, and with regard to closure: not closable, just a flap, or with a button or zipper. with or without hoodSome combinations are not applicable, e.g. a tube top cannot have a collar. The main measures for a jacket are: Shoulders Bust Waist Hip Sleeve Length, from the neck to the waist or hip. Asia Size M = US/EU Size XS. Asia Size L = US/EU Size S. Asia Size XL = US/EU Size M. Asia Size XXL = US/EU Size L. Asia Size XXXL = US/EU Size XL. Asia Size XXXXL = US/EU Size XXL. There are two main categories of fibres used: natural fibre and man-made fibre . Some natural fibres are linen, the first used historically, hemp, cotton, the most used, ramie, wool, silk and more recently bamboo or soya. Some synthetic fibres are polyester, tencel, viscose, etc. Polyester mixed with cotton is often used. Fabrics for shirts are called shirtings. The four main weaves for shirtings are plain weave, oxford, twill and satin. Broadcloth, poplin and end-on-end are variations of the plain weave. After weaving, finishing can be applied to the fabric. In the 1920s and 1930s, fascists wore different coloured shirts: Black shirts were used by the Italian fascists, and in Britain, Finland and Germany and Croatia. The party leaders of Dravidar Kazhagam in India wear only black shirts to symbolise atheism. Brownshirts were worn by German Nazis of the SA. The Blueshirts was a fascist movement in Ireland and Canada, and the colour of the Portuguese Nacional Sindicalistas, the Spanish Falange Española, the French Solidarité Française, and the Chinese Blue Shirts Society. Green shirts were used in Hungary, Ireland, Romania, Brazil and Portugal. Camisas Doradas were used in Mexico. Red shirts were worn by the racist and antisemitic Bulgarian Ratniks. Silver Shirts were worn in the United States of America. Grey shirts were worn by members of the Fatherland League in Norway.In addition, red shirts have been used to symbolize a variety of different political groups, including Garibaldi's Italian revolutionaries, nineteenth-century American street gangs, and socialist militias in Spain and Mexico during the 1930s. Different colored shirts signified the major opposing sides that featured prominently in the 2008 Thai political crisis, with red having been worn by the supporters of the populist People's Power Party , and yellow being worn by the supporters of the royalist and anti-Thaksin Shinawatra movement the People's Alliance for Democracy . Each side is commonly referred to as the 'red shirts' and 'yellow shirts' respectively, though the later opponents of the later Thaksin supporting groups have largely ceased wearing yellow shirts to protest rallies. In the UK, the Social Credit movement of the thirties wore green shirts. Cardigan Descamisado Jermyn Street, home of the oldest English shirtmakers \"Introduction to 18th-century fashion\". Fashion, Jewellery & Accessories. Victoria and Albert Museum. \"Introduction to 19th-century fashion\". Fashion, Jewellery & Accessories. Victoria and Albert Museum.","sentences":[{"text":"A shirt is a cloth garment for the upper body .","keywords":["upper body","cloth garment","shirt"],"images":["https://cdn.shopify.com/s/files/1/0486/2273/products/MFF_WEB--73.jpg?v=1527632600","https://cmkt-image-prd.freetls.fastly.net/0.1.0/ps/4405859/910/1365/m2/fpnw/wm1/vvndjd9wbzc17ruzwy6vefnokgmv5t88wrxx8icgh9tvpsm7duzyerhkrz4hkf5m-.jpg?1525466552&s=2e0640d2b5b960b81b167381cb1a71ad"],"googleSearchQuery":"t-shirt upper body"},{"text":"Originally an undergarment worn exclusively by men, it has become, in American English, a catch-all term for a broad variety of upper-body garments and undergarments.","keywords":["American English","broad variety of upper-body garments","undergarments","men","term","undergarment","catch"],"images":["https://ctl.s6img.com/society6/img/DVeZfcnGSyHdKOMAiXHtdOv3Luc/w_1500/tshirts/men/greybg/tri-black/~artwork,bg_FFFFFFFF,fw_3301,fh_5106,fx_-150,fy_389,iw_3600,ih_4320/s6-original-art-uploads/society6/uploads/misc/1dad7c67e8d2464d81d739bcab4486db/~~/american-english-coonhound-funny-dog-addiction-tshirts.jpg","https://s3-eu-west-1.amazonaws.com/images.linnlive.com/4a3fc06eb1b04726bf024759db185f2f/04d40974-fc49-4b53-bd5b-9de2eb409706.jpg"],"googleSearchQuery":"t-shirt American English"},{"text":"In British English, a shirt is more specifically a garment with a collar, sleeves with cuffs, and a full vertical opening with buttons or snaps .","keywords":["British English","full vertical opening","shirt","garment","collar","sleeves","cuffs","buttons","snaps"],"images":["https://ae01.alicdn.com/kf/HTB1udYlQFXXXXXkaXXXq6xXFXXXv/MENS-FUNNY-COOL-NOVELTY-ENGLISH-ENGLAND-SLOGAN-JOKE-BRITISH-GIFTS-IDEAS-T-SHIRTS-T-Shirt-Summer.jpg","https://images-na.ssl-images-amazon.com/images/I/81f7QY7UUNL._UL1500_.jpg"],"googleSearchQuery":"t-shirt British English"},{"text":"A shirt can also be worn with a necktie under the shirt collar.","keywords":["shirt collar","shirt","necktie"],"images":["https://cdn.shopify.com/s/files/1/1377/1251/products/17010201_D1.jpg?v=1547557752","https://ae01.alicdn.com/kf/H0d5e556650a647728b14e4c96827d1a6k/Mens-T-Shirts-Fashion-Contrast-Color-Patchwork-Long-Sleeve-Slim-Fit-Cotton-Collar-T-Shirt-Male.jpg"],"googleSearchQuery":"t-shirt shirt collar"},{"text":"The world's oldest preserved garment, discovered by Flinders Petrie, is a \"highly sophisticated\" linen shirt from a First Dynasty Egyptian tomb at Tarkan, dated to c. 3000 BC: \"the shoulders and sleeves have been finely pleated to give form-fitting trimness while allowing the wearer room to move.","keywords":["Flinders Petrie","linen shirt","world","First Dynasty","form-fitting trimness","shoulders","garment","sleeves","Egyptian tomb","wearer room","BC","Tarkan"],"images":["http://a.mktgcdn.com/p/Mkh32ZUgQINSlFD1Zin_uTkdSak2KatLLYkwjgmV9wA/3815x2765.jpg","https://museumcrush.org/wp-content/uploads/2016/09/Figure-1-1.jpg"],"googleSearchQuery":"t-shirt Flinders Petrie"},{"text":"The small fringe formed during weaving along one edge of the cloth has been placed by the designer to decorate the neck opening and side seam.\"The shirt was an item of clothing that only men could wear as underwear, until the twentieth century.","keywords":["small fringe","edge of the cloth","item of clothing","twentieth century","shirt","designer","men","underwear","neck opening","side seam"],"images":["https://i.etsystatic.com/7552910/r/il/5125bd/1551043299/il_fullxfull.1551043299_lqdr.jpg","https://cdn.shopify.com/s/files/1/0609/6429/products/B3B855C7-DB23-450D-AA6C-AB536E1F118D.jpeg?v=1528346208"],"googleSearchQuery":"t-shirt small fringe"},{"text":"Although the women's chemise was a closely related garment to the men's, it is the men's garment that became the modern shirt.","keywords":["women's chemise","related garment","men","men's garment","modern shirt"],"images":["https://ae01.alicdn.com/kf/H083b0ac380f34340bfed441ef8758ec6e/Men-T-shirt-CAMICIA-CHEMISE-HEMD-OPEL-GSI-16V-ASTRA-KADETT-CORSA-MANTA-funny-t-shirt.jpg","https://cbu01.alicdn.com/img/ibank/2019/338/144/11642441833_1528924397.jpg"],"googleSearchQuery":"t-shirt women's chemise"}]}